contrib-other/camelse/examples/file2jbi/File2JBICamelCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cam="http://openesb.org/camel2jbi/message/Camel2BpelJBIModule">
    <soapenv:Body>
        <cam:AnyMessage>
            <person user="srini">
                <firstName>Srini</firstName>
                <lastName>Chikkalaa</lastName>
                <city>London</city>
            </person>
        </cam:AnyMessage>
    </soapenv:Body>
</soapenv:Envelope>